#include <stdio.h>
#include <math.h>
#define MEM 100

int i,j,r,k;

int ei=4;
int ej=4;
double a[MEM] = {0,0,0,1,1,0,0};
double ar[MEM] = {0,0,1.5708,0,0,1.5708,0};
double d[MEM]={1,0,0,0,0,0,1};
//double the[MEM]={0,0,0,0,0,0,0};
//double the[MEM]={0,0,0.3141592,0.78539816339,0,0,0};
//double the[MEM]={0, 0,  1.413,  0.31415,    0.157079,   0,  0,  0};
double the[MEM]={0, 0,  0.314,  -0.785,    1.570,   0,  0,  0};

//double the[MEM]={0,0,1.256637061,0.157079633,0,0,0};

double T[MEM][MEM];
double RT[MEM][MEM];
double TA[MEM][MEM];
double X[MEM][MEM];
double Y[MEM][MEM];
double Z[MEM][MEM];
double P[MEM][MEM];
double P_i[MEM][MEM];
double ZP_GAI[MEM][MEM];
double ZP[MEM][MEM];

int main() {
    printf("\n\n===問題(1.1)=======================================\n\n");
    for(r=0;r<7;r++){
        T[0][0]=cos(the[r]);
        T[0][1]=-sin(the[r]);
        T[0][2]=0;
        T[0][3]=a[r];
        T[1][0]=cos(ar[r])*sin(the[r]);
        T[1][1]=cos(ar[r])*cos(the[r]);
        T[1][2]=-sin(ar[r]);
        T[1][3]=-d[r]*sin(ar[r]);
        T[2][0]=sin(ar[r])*sin(the[r]);
        T[2][1]=sin(ar[r])*cos(the[r]);
        T[2][2]=cos(ar[r]);
        T[2][3]=d[r]*cos(ar[r]);
        T[3][0]=0;
        T[3][1]=0;
        T[3][2]=0;
        T[3][3]=1;
        printf("===============↓%dT%d↓===============\n",r-1,r);
        if(r==0){
            for(i=0;i<4;i++){
                for(j=0;j<4;j++){
                    TA[i][j]=T[i][j];
                }
            }
        }else{
            for(i=0;i<4;i++){
                for(j=0;j<4;j++){
                    for(k=0;k<4;k++){
                        RT[i][j]+=TA[i][k]*T[k][j];
                    }
                }
            }
            for(i=0;i<4;i++){
                for(j=0;j<4;j++){
                    TA[i][j]=RT[i][j];
                    RT[i][j]=0;
                }
            }
        }
        /**************************************************************************/
        for(i=0;i<4;i++){
            for(j=0;j<4;j++){
                if(fabs(TA[i][j])<0.00001){
                    TA[i][j]=0;
                }
                if(fabs(T[i][j])<0.00001){
                    T[i][j]=0;
                }
                printf("%0.5f   ",T[i][j]);
            }
            X[r][i]=TA[i][0];
            Y[r][i]=TA[i][1];
            Z[r][i]=TA[i][2];
            P[r][i]=TA[i][3];
            printf("\n");
        }
    }
    printf("===================================\n");
    /******************************************************************************************************/
    printf("\n\n===問題(1.2)=======================================\n\n");
    /*for(i=0;i<4;i++){
        for(j=0;j<4;j++){
            printf("%6.1f",TA[i][j]);
        }
        printf("\n");
    }*/
    for(r=0;r<7;r++){
        printf("===============↓RT%d↓======================================\n",r);
        printf("   RX%d          RY%d           RZ%d          RP%d\n",r,r,r,r);
        printf("===========================================================\n");
        for(j=0;j<4;j++){
            printf("%6.5f       %6.5f        %6.5f       %6.5f\n",X[r][j],Y[r][j],Z[r][j],P[r][j]);
            //printf("%.0f%.0f%.0f%.0f\n",X[r][j],Y[r][j],Z[r][j],P[r][j]);
            //printf("%6.5f\n",Z[r][j]);

        }
    }
    /******************************************************************************************************/
    printf("\n\n===問題(1.3)=======================================\n\n");
    printf("===================================\n");
    printf("   RPE       RPi       RPE,i\n");
    for(i=1;i<7;i++){
        printf("===============↓RT%d↓===============\n",i);
        for(j=0;j<3;j++){
            P_i[i][j]=P[6][j]-P[i][j];
            printf("%6.1f   -%6.1f   =%6.1f\n",P[6][j],P[i][j],P_i[i][j]);
        }
    }
    /************************************以下外積********************************************/
    printf("===================================\n\n");
    printf("===============↓外積計算結果↓===============\n");
    for(i=0;i<7;i++){
            ZP_GAI[i][0]=(Z[i][1]*P_i[i][2])-(Z[i][2]*P_i[i][1]);
            ZP_GAI[i][1]=(Z[i][2]*P_i[i][0])-(Z[i][0]*P_i[i][2]);
            ZP_GAI[i][2]=(Z[i][0]*P_i[i][1])-(Z[i][1]*P_i[i][0]);
    }
    for(i=1;i<7;i++){
        printf("===============↓RT%d↓===============\n",i);
        for(j=0;j<3;j++){
            if(fabs(ZP_GAI[i][j])<0.00001){
                ZP_GAI[i][j]=0;
            }
            printf("%6.5f       \n",ZP_GAI[i][j]);
        }
    }
}


